<a href="https://colab.research.google.com/github/NovAntoN/PrIS_02/blob/main/03_03_2021.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# import packages

In [2]:
import pandas as pd
import numpy as np
from IPython.display import display

# import data

In [3]:
data = pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/glass/glass.data", header=None)
data.head(3)

   0        1      2     3     4      5     6     7    8    9   10
0   1  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0   1
1   2  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0   1
2   3  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0   1

In [4]:
names = ["Id", "RI", "Na", "Mg", "Al", "Si", "K", "Ca", "Ba", "Fe", "Class"]
data.columns = names
data = data.drop(columns=['Id'])
data.head(3)

        RI     Na    Mg    Al     Si     K    Ca   Ba   Fe  Class
0  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0      1
1  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0      1
2  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0      1

In [6]:
data['Class'].replace({1:"building_float",
                       2:"building_non_float",
                       3:"vehicle_float",
                       4:"vehicle_non_float",
                       5:"containers",
                       6:"tableware",
                       7:"headlamps"}, inplace=True)
data['Class'].value_counts()

building_non_float    76
building_float        70
headlamps             29
vehicle_float         17
containers            13
tableware              9
Name: Class, dtype: int64

In [12]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 214 entries, 0 to 213
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RI      188 non-null    float64
 1   Na      182 non-null    float64
 2   Mg      187 non-null    float64
 3   Al      186 non-null    float64
 4   Si      184 non-null    float64
 5   K       184 non-null    float64
 6   Ca      191 non-null    float64
 7   Ba      187 non-null    float64
 8   Fe      177 non-null    float64
 9   Class   190 non-null    object
dtypes: float64(9), object(1)
memory usage: 16.8+ KB

In [11]:
for col in data.columns:
  fr = np.random.randint(5,10)/100
  data.loc[data.sample(frac=fr).index, col] = np.nan

# data vizualization

In [13]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 214 entries, 0 to 213
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RI      188 non-null    float64
 1   Na      182 non-null    float64
 2   Mg      187 non-null    float64
 3   Al      186 non-null    float64
 4   Si      184 non-null    float64
 5   K       184 non-null    float64
 6   Ca      191 non-null    float64
 7   Ba      187 non-null    float64
 8   Fe      177 non-null    float64
 9   Class   190 non-null    object
dtypes: float64(9), object(1)
memory usage: 16.8+ KB

In [14]:
data.describe()

               RI          Na          Mg  ...          Ca          Ba          Fe
count  188.000000  182.000000  187.000000  ...  191.000000  187.000000  177.000000
mean     1.518508   13.386648    2.707807  ...    8.932304    0.165561    0.051073
std      0.003090    0.808302    1.438875  ...    1.429948    0.462550    0.088115
min      1.511310   10.730000    0.000000  ...    5.430000    0.000000    0.000000
25%      1.516627   12.882500    2.220000  ...    8.225000    0.000000    0.000000
50%      1.517785   13.295000    3.490000  ...    8.570000    0.000000    0.000000
75%      1.519280   13.772500    3.610000  ...    9.145000    0.000000    0.090000
max      1.533930   17.380000    4.490000  ...   16.190000    2.880000    0.350000

[8 rows x 9 columns]

In [17]:
display(print("============================="))
display(data['Class'].describe())
display(print("============================="))
display(data['Class'].value_counts())

=============================

None

count                    190
unique                     6
top       building_non_float
freq                      66
Name: Class, dtype: object

=============================

None

building_non_float    66
building_float        63
headlamps             26
vehicle_float         17
containers            11
tableware              7
Name: Class, dtype: int64